package HW1.menu;

public final class Menu {
     public static void menuInCoffeeMachine(){
        System.out.println(
                "1. Показати поточний обсяг води і кави\n" +
                "2. Приготувати \"Американо\"\n" +
                "3. Приготувати \"Еспрессо\"\n" +
                "4. Приготувати \"Подвійний еспресо\"\n" +
                "5. Заповнити бак з водою\n" +
                "6. Заповнити бак з кавою\n" +
                "7. Інформація\n" +
                "8. Вимкнути кавоварку"
        );
    }
}
